cfd/openfoam/compressible/rhoSimpleFoam/04_Vorticity/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

// ************************************************************************* //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $turbulentKE;


boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        value       $internalField;
        inletValue  $internalField;
    }
    
    freestream
    {
        type        slip;
    }

    model
    {
        type        kqRWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}


// ************************************************************************* //
