cfd/openfoam/compressible/rhoSimpleFoam/04_Vorticity/system/include/referenceData
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Reference data for force coefficient computations
referenceLength     2.302;
referenceArea       5.748e-2;
